In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [4]:
df = pd.read_csv('F:/expe/Data_Science_Jobs_in_India.csv')
df.head()

,Unnamed: 0,company_name,job_title,min_experience,avg_salary,min_salary,max_salary,num_of_salaries
0,0,TCS,Data Scientist,2,7.8L,4.5L,16.0L,841
1,1,Accenture,Data Scientist,2,12.8L,5.8L,23.0L,501
2,2,IBM,Data Scientist,2,13.4L,5.3L,25.0L,394
3,3,Cognizant,Data Scientist,2,9.8L,5.0L,18.0L,318
4,4,Capgemini,Data Scientist,2,8.6L,4.8L,14.6L,300

In [5]:
df.shape

(1602, 8)

In [6]:
df.describe()

        Unnamed: 0  min_experience  num_of_salaries
count  1602.000000     1602.000000      1602.000000
mean    800.500000        2.799001        58.055556
std     462.601881        2.353686       169.042138
min       0.000000        0.000000         3.000000
25%     400.250000        1.000000         9.250000
50%     800.500000        2.000000        22.000000
75%    1200.750000        4.000000        47.000000
max    1601.000000       21.000000      4200.000000